## GDP of all Countries

In [2]:
import os
import pandas as pd 
import plotly.express as px
import plotly.offline as pyo

df = pd.read_csv('gdp.csv')

final_data = []

for country_name in df['Country Name'].unique():
    df_pr = df[df['Country Name'] == country_name]
    data = df_pr.values
    
    gdp_change = [0]  # first value = 0 because no previous year
    
    for i in range(1, len(data)):
        prev = data[i-1][3]
        cur = data[i][3]
        
        if prev == 0:   # avoid division by zero
            gdp_change.append(0)
        else:
            gdp_change.append(round(((cur - prev) / prev) * 100, 2))
    
    df_pr = df_pr.assign(GDP=gdp_change)
    final_data.append(df_pr)

df = pd.concat(final_data, axis=0)

df.head()

  Country Name Country Code  Year         Value    GDP
0   Arab World          ARB  1968  2.576068e+10   0.00
1   Arab World          ARB  1969  2.843420e+10  10.38
2   Arab World          ARB  1970  3.138550e+10  10.38
3   Arab World          ARB  1971  3.642691e+10  16.06
4   Arab World          ARB  1972  4.331606e+10  18.91

In [3]:
fig = px.line(df, x = 'Year' , y = 'Value' , title ='GDP Analysis of All Countries', color = 'Country Name')
pyo.plot(fig, filename = 'Countries GDP.html' )

'Countries GDP.html'

In [4]:
df

      Country Name Country Code  Year         Value    GDP
0       Arab World          ARB  1968  2.576068e+10   0.00
1       Arab World          ARB  1969  2.843420e+10  10.38
2       Arab World          ARB  1970  3.138550e+10  10.38
3       Arab World          ARB  1971  3.642691e+10  16.06
4       Arab World          ARB  1972  4.331606e+10  18.91
...            ...          ...   ...           ...    ...
11502     Zimbabwe          ZWE  2012  1.424249e+10  17.72
11503     Zimbabwe          ZWE  2013  1.545177e+10   8.49
11504     Zimbabwe          ZWE  2014  1.589105e+10   2.84
11505     Zimbabwe          ZWE  2015  1.630467e+10   2.60
11506     Zimbabwe          ZWE  2016  1.661996e+10   1.93

[11507 rows x 5 columns]

## GDP Comparison between India & China

In [6]:
c1 = df[df['Country Name'] == 'China']
c2 = df[df['Country Name'] == 'India']

In [7]:
c2.head()

     Country Name Country Code  Year         Value    GDP
6074        India          IND  1960  3.653593e+10   0.00
6075        India          IND  1961  3.870910e+10   5.95
6076        India          IND  1962  4.159907e+10   7.47
6077        India          IND  1963  4.777600e+10  14.85
6078        India          IND  1964  5.572687e+10  16.64

In [8]:
df_pr = pd.concat([c1,c2],axis = 0)

In [9]:
df_pr

     Country Name Country Code  Year         Value    GDP
4046        China          CHN  1960  5.971647e+10   0.00
4047        China          CHN  1961  5.005687e+10 -16.18
4048        China          CHN  1962  4.720936e+10  -5.69
4049        China          CHN  1963  5.070680e+10   7.41
4050        China          CHN  1964  5.970834e+10  17.75
...           ...          ...   ...           ...    ...
6126        India          IND  2012  1.827638e+12   0.25
6127        India          IND  2013  1.856722e+12   1.59
6128        India          IND  2014  2.035393e+12   9.62
6129        India          IND  2015  2.089865e+12   2.68
6130        India          IND  2016  2.263792e+12   8.32

[114 rows x 5 columns]

In [11]:
fig = px.line(df_pr, x="Year", y="Value", title="GDP Comparison | India & China", color="Country Name")

pyo.plot(fig, filename="GDP_Comparison_IND_CHN.html", auto_open=True)

'GDP_Comparison_IND_CHN.html'

In [12]:
## WE CAN ALso check it for china and world , and for any two countries